Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/civil_annulment/nullity_of_civil_partnership.html.txt.tmx
Source language: en
Languages: ga

source: Nullity of civil partnership
ga: Neamhniú ar pháirtnéireacht shibhialta

source: Nullity of civil partnership is a declaration by a court that your supposed civil partnership is null and void, and that no valid civil partnership exists between you and your partner
ga: Is forógra ó chúirt é neamhniú ar pháirtnéireacht shibhialta go bhfuil do pháirtnéireacht shibhialta cheaptha ar neamhní go hiomlán, agus nach maireann páirtnéireacht shibhialta idir tú agus do pháirtnéir

source: In other words, it is a declaration that the supposed civil partnership never happened
ga: I bhfocail eile, is forógra é nár tharla an pháirtnéireacht shibhialta riamh

source: Nullity (or annulment) is not the same as dissolution
ga: Níl neamhniú mar an gcéanna le díscaoileadh

source: Dissolution is a declaration ending a valid civil partnership
ga: Is forógra é díscaoileadh ag cur críoch le páirtnéireacht shibhialta bhailí

source: Nullity is a declaration that a valid civil partnership never existed
ga: Is forógra é neamhniú nár tharla an pháirtnéireacht shibhialta bhailí riamh

source: In nullity of marriage law, there are two types of marriages that may be annulled or cancelled
ga: I ndlí neamhniú pósta, tá dhá chineál pósadh ar féidir iad a chur ar neamhní

source: There are void marriages and there are voidable marriages
ga: Tá póstaí neamhnithe agus póstaí in-neamhnithe

source: If your marriage is void, it is regarded as never having taken place
ga: Má tá do phósadh neamhnithe, féachfar air nár tharla sé riamh

source: If your marriage is voidable, it is considered to be a valid marriage until a decree of annulment is made
ga: Má tá do phósadh in-neamhnithe, meastar gur pósadh bailí atá ann go dtí go ndéantar foraithne neamhnithe

source: In nullity of civil partnership law, there are only void civil partnerships
ga: I ndlí neamhnithe pháirtnéireacht shibhialta, níl ann ach páirtnéireachtaí sibhialta neamhnithe

source: This means the civil partnerships are regarded as never having taken place
ga: Ciallaíonn sé seo go bhféachfar ar na páirtnéireachtaí sibhialta nár tharla siad riamh

source: Technically, if your civil partnership never took place, then there is no need to go to court to obtain a decree of annulment - you may simply act as though the civil partnership never happened
ga: Go teicniúil, murar tharla do pháirtnéireacht shibhialta riamh, níl aon ghá dul chun cúirte chun foraithne neamhnithe a fháil – is féidir leat díreach gníomhú ar nós nár tharla an pháirtnéireacht shibhialta riamh

source: However, it is advisable to obtain a court order declaring that your civil partnership is annulled in order to remove any doubt
ga: Tá sé inmholta, áfach, ordú cúirte a fháil ag dearbhú go bhfuil do phairtnéireacht shibhialta curtha ar neamhní chun fáil réidh le haon amhras

source: A decree of annulment can only be made if one of the parties to the civil partnership applies to the court for a decree of nullity
ga: Ní féidir foraithne neamhnithe a dhéanamh ach amháin má chuireann ceann den dá pháirtí isteach chuig an gcúirt ar fhoraithne neamhnithe

source: Any person whom the court believes has sufficient standing to do so may also apply
ga: Is feidir le haon duine a cheapann an chúirt go bhfuil seasamh dóthanach aige chun é seo a dhéanamh cur isteach air

source: If the court decides that your civil partnership is void, it will then declare that your civil partnership never existed
ga: Má chinneann an chúirt go bhfuil do pháirtnéireacht shibhialta neamhnithe, dearbhóidh sí ansin nach raibh do pháirtnéireacht shibhialta riamh ann

source: You can find out about the implications of a decree of nullity in our document on the consequences of an annulment of a civil partnership
ga: Is féidir leat a fháil amach faoi na himpleachtaí atá ag foraithne neamhnithe inár gcáipéis ar chúinsí de neamhniú ar pháirtnéireacht shibhialta

source: In order to obtain an annulment (nullity) of your alleged civil partnership, you must make an application to the Circuit Court or the High Court
ga: Chun neamnhiú a fháil ar do pháirtnéireacht shibhialta líomhnaithe, caithfidh tú iarratas a chur isteach chuig an gCúirt Chuarda nó an Chúirt Uachtarach

source: To prove to the court that your civil partnership is void you must show one of the following grounds:
ga: Chun a chruthú don chúirt go bhfuil do pháirtnéireacht shibhialta neamhnithe caithfidh tú ceann de na forais a leanas a thaispeáint:

source: • At the time of the registration of the civil partnership there was a lack of capacity
ga: • Ag am cláraithe an pháirtnéireacht shibhialta bhí easpa cumais

source: In other words, you or your parner was incapable of entering into a binding contract
ga: I bhfocail eile, ní raibh sé ar do chumas nó ar chumas do pháirtnéara dul isteach i gconradh ceangailteach

source: - where one of you was already validly married or in a civil partnership or
ga: - áit a raibh duine agaibh pósta go bailí cheana nó i bpáirtnéireacht shibhialta nó

source: - where you were too closely related to each other or
ga: - áit a raibh sibh róghar i ngaol lena chéile nó

source: - where you were of opposite biological sex or
ga: - áit a raibh sibh ar ghnéis bhitheolaíochta dhifriúla nó

source: - where one of you was under 18 years of age
ga: - áit a raibh duine agaibh faoi 18 bliain

source: • The formal requirements for the registration of a civil partnership were not followed
ga: • Níor leanadh ceanglais fhoirmeálta do chlárú pháirtnéireacht shibhialta

source: For example, you did not give due notice to the civil registrar
ga: Mar shampla, níor thug tú fógra dlite don gcláraitheoir sibhialta

source: • At the time of the registration of the civil partnership, there was a lack of consent
ga: • Ag am cláraithe an phairtnéireacht shibhialta, bhí easpa comhthola ann

source: In other words, you or your partner did not give free and fully informed consent to the civil partnership
ga: I bhfocail eile, níor thug tú ná do pháirtnéir comhthoil shaor agus láneolasach don pháirtnéireacht shibhialta

source: This may be due to duress, (i.e., you were forced into the civil partnership), mistake, misrepresentation or fraud
ga: D’fhéadfaí gur mar gheall ar éigeantas (eadhon, cuireadh iallach ort dul isteach sa pháirtnéireacht shibhialta), botún, bréagléiriú nó calaois

source: It may also be due to the fact that you or your partner was suffering from a mental illness at that time
ga: D’fhéadfaí freisin gur mar gheall ar an bhfíric go raibh tú féin nó do pháirtnéir ag fulaingt le meabhairghalar ag an am

source: Legal advice and representation is always advisable
ga: Tá comhairle agus ionadaíocht dhlí inmholta i gcónaí

source: You and your partner should not use the same solicitor
ga: Níor cheart duit féin na do pháirtnéir an t-aturnae céanna a úsáid

source: To enquire whether you are eligible for Legal Aid, you can contact your nearest law centre
ga: Chun fiosrúcháin a dhéanamh maidir lena bhfuil tú incháilithe do Chúnamh Dlí, is féidir leat dul i dteagmháil leis an ionad dlí is gaire duit

source: Legal Aid is not free and everyone must pay a contribution towards costs
ga: Níl Cúnamh Dlí saor in aisce agus caithfidh gach duine ranníocaícht a dhéanamh chuig costais

source: FLAC (Free Legal Advice Centres) is an independent, voluntary organisation that operates a network of legal advice clinics throughout the country
ga: Is eagraíocht neamhspleách dheonach í ICDSA (Ionaid Chomhairle Dlí Saor in Aisce) a oibríonn líonra clinicí comhairle dlí ar fud na tíre

source: These clinics are confidential, free of charge and open to all
ga: Tá na clinicí seo faoi rún, saor in aisce agus oscailte do gach duine

source: Contact your nearest Citizens Information Centre for information on FLAC services in your area
ga: Téigh i dteagmháil leis an Ionad Eolais do Shaoránaigh is gaire duit d’eolas ar sheirbhísí ICDSA i do cheantar

source: FLAC also runs an information and referral line during office hours for basic legal information
ga: Ritheann ICDSA líne eolais agus atreoraithe i rith uaireanta oifige d’eolas dlí bunúsach

source: If you choose to hire a private solicitor, you should be aware that there is no fixed rate of charges for legal fees
ga: Má roghnaíonn tú aturnae príomhaideach a fhostú, ba cheart go mbeadh a fhios agat nach bhfuil aon ráta seasta do mhuirir do tháillí dlí

source: You are advised to obtain some quotes before deciding on a legal firm
ga: Cuirtear comhairle ort roinnt luanna a fháil sula gcinneoidh tú ar ghnólacht dlí

source: Contact information for solicitors firms throughout Ireland is available on the Law Society website
ga: Tá Eolas teagmhála do ghnólachtaí aturnaetha ar fud na hÉireann ar fáil ar shuíomh gréasáin Dhlí-Chumann na hÉireann
